1s/ERP/Conf/Enums/ПоказателиОтложенногоНалога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ПоказателиОтложенногоНалога</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПрибыльДоНалогообложения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенныйНалогНачалоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенныйНалоговыйАктивНачалоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенноеНалоговоеОбязательствоНачалоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенныйНалогКонецПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенныйНалоговыйАктивКонецПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенноеНалоговоеОбязательствоКонецПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенныйНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭффектИзмененияВременныхРазниц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭффектИзмененияСтавкиТекущегоНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭффектИзмененияСтавкиБудущегоНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТекущийНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасходПоНалогу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходПоНалогу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УсловныйРасход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УсловныйДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостоянныйНалоговыйРасход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостоянныйНалоговыйДоход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧистаяПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВлияниеУбыткаТекущегоПериода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПостояннаяРазница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВременнаяРазница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенныйРасход</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыбытиеПоСпециальнымРежимам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетныйТекущийНалог</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаТекущегоНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВлияниеОшибокУчетаРазниц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВлияниеОшибокУчетаОтложенногоНалога</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НалогНаПрибыльОтОперацийКоторыеНеВключаютсяВЧистуюПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭффектИзмененияСуммыОперацийНеВключаемыхВЧистуюПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПересчетОтложенногоНалогаПриИзмененииВариантаНалогообложенияПрибыли</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеНалогаНаПрибыльОтОперацийКоторыеНеВключаютсяВЧистуюПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПересчетНалогаОтОперацийКоторыеНеВключаютсяВЧистуюПрибыльПриИзмененииВарианта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИнвестиционныйВычет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложенныйНалоговыйАктивИнвестиционныйВычет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/ПоказателиОтложенногоНалога/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Определяет код показателя. Нумерация основана на Приложении 1 ПБУ 18.
//
// Параметры:
//  Показатель      - ПеречислениеСсылка.ПоказателиОтложенногоНалога
//  КодыПоказателей - Соответствие - при вызове функции в цикле можно организовать кеш;
//                    Переменную кеша не следует инициализировать до вызова функции (должна иметь значение Неопределено)
// 
// Возвращаемое значение:
//  Строка - код показателя
//
Функция Код(Показатель, КодыПоказателей = Неопределено) Экспорт
	
	Если КодыПоказателей = Неопределено Тогда
		КодыПоказателей = КодыПоказателей();
	КонецЕсли;
	
	Код = КодыПоказателей[Показатель];
	
	Если Код = Неопределено Тогда
		// Показатели без кода используются для сохранения информации, позволяющей найти ошибки в сложных случаях.
		// Они не являются частью регистров бухгалтерского учета.
		Возврат НСтр("");
	Иначе
		Возврат Код;
	КонецЕсли;
	
КонецФункции

// Содержит коды показателей. Нумерация основана на Приложении 1 ПБУ 18.
//
// Возвращаемое значение:
//  Соответствие - коды показателей. Ключ - показатель, Значение - представление.
//
Функция КодыПоказателей() Экспорт
	
	КодыПоказателей = Новый Соответствие;
	
	КодыПоказателей.Вставить(
		ПрибыльДоНалогообложения,
		НСтр("ru = 'А';
			|en = 'A'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалоговыйАктивНачалоПериода,
		НСтр("ru = 'Б';
			|en = 'B'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенноеНалоговоеОбязательствоНачалоПериода,
		НСтр("ru = 'В';
			|en = 'С'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалоговыйАктивКонецПериода,
		НСтр("ru = 'Г';
			|en = 'D'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенноеНалоговоеОбязательствоКонецПериода,
		НСтр("ru = 'Д';
			|en = 'E'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ПостояннаяРазница,
		НСтр("ru = 'Е';
			|en = 'F'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		НалогНаПрибыльОтОперацийКоторыеНеВключаютсяВЧистуюПрибыль,
		НСтр("ru = 'Ж';
			|en = 'F'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ИзменениеНалогаНаПрибыльОтОперацийКоторыеНеВключаютсяВЧистуюПрибыль,
		НСтр("ru = 'З';
			|en = '3'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ПересчетНалогаОтОперацийКоторыеНеВключаютсяВЧистуюПрибыльПриИзмененииВарианта,
		НСтр("ru = 'И';
			|en = 'C'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ИнвестиционныйВычет,
		НСтр("ru = 'К';
			|en = 'К'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалоговыйАктивИнвестиционныйВычет,
		НСтр("ru = 'Л';
			|en = 'Л'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалогНачалоПериода,
		НСтр("ru = '1';
			|en = '1'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалогКонецПериода,
		НСтр("ru = '2';
			|en = '2'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ОтложенныйНалог,
		НСтр("ru = '3';
			|en = '3'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ЭффектИзмененияВременныхРазниц,
		НСтр("ru = '3А';
			|en = '3А'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ЭффектИзмененияСтавкиТекущегоНалога,
		НСтр("ru = '3Б';
			|en = '3B'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ЭффектИзмененияСтавкиБудущегоНалога,
		НСтр("ru = '3В';
			|en = '3C'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ЭффектИзмененияСуммыОперацийНеВключаемыхВЧистуюПрибыль,
		НСтр("ru = '3Г';
			|en = '3D'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ТекущийНалог,
		НСтр("ru = '4';
			|en = '4'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		РасходПоНалогу,
		НСтр("ru = '5';
			|en = '5'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ДоходПоНалогу,
		НСтр("ru = '5';
			|en = '5'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		УсловныйРасход,
		НСтр("ru = '6';
			|en = '6'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		УсловныйДоход,
		НСтр("ru = '6';
			|en = '6'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ПостоянныйНалоговыйРасход,
		НСтр("ru = '7';
			|en = '7'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ПостоянныйНалоговыйДоход,
		НСтр("ru = '7';
			|en = '7'", ОбщегоНазначения.КодОсновногоЯзыка()));
	КодыПоказателей.Вставить(
		ЧистаяПрибыль,
		НСтр("ru = '8';
			|en = '8'", ОбщегоНазначения.КодОсновногоЯзыка()));
	
	Возврат КодыПоказателей;
	
КонецФункции

#КонецОбласти

#КонецЕсли
